Revit 2027 API
Water.WaterTintColor Property
 The property labeled "Custom Color" from the "Water" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WaterTintColor { get; }
Public Shared ReadOnly Property WaterTintColor As String
	Get
public:
static property String^ WaterTintColor {
	String^ get ();
}
static member WaterTintColor : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Reference
Water Class
Autodesk.Revit.DB.Visual Namespace